In [161]:
import pandas as pd
pd.options.display.max_rows

60

In [162]:
pd.options.display.max_rows = 18

In [163]:
pd.options.display.max_rows

18

In [19]:
week1 = pd.read_csv('../../datasets/Restaurant - Week 1 Sales.csv')

In [20]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [21]:
week1.count()

Customer ID    250
Food ID        250
dtype: int64

In [22]:
week2 = pd.read_csv('../../datasets/Restaurant - Week 2 Sales.csv')

In [23]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [24]:
week2.count()

Customer ID    250
Food ID        250
dtype: int64

In [25]:
customers = pd.read_csv('../../datasets/Restaurant - Customers.csv')

In [26]:
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [27]:
customers.count()

ID            1000
First Name    1000
Last Name     1000
Gender        1000
Company       1000
Occupation    1000
dtype: int64

In [28]:
food = pd.read_csv('../../datasets/Restaurant - Foods.csv')

In [29]:
food.count()

Food ID      10
Food Item    10
Price        10
dtype: int64

In [33]:
week1_2 = pd.concat(objs=[week1, week2])

In [34]:
week1_2

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [37]:
week1_2.loc[249]

     Customer ID  Food ID
249          535       10
249          249        6

In [40]:
week1_2 = pd.concat(objs=[week1, week2], ignore_index=True)

In [41]:
week1_2

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [45]:
week1_2 = week1.append(other = week2, ignore_index=True)

In [46]:
week1_2

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

### The keys attribute splits the new dataframe in different sections. Each row has a different unique identifier

In [76]:
week1_2 = pd.concat(objs=[week1, week2], keys=['any string', 'week2'])

In [77]:
week1_2

                Customer ID  Food ID
any string 0            537        9
           1             97        4
           2            658        1
           3            202        2
           4            155        9
...                     ...      ...
week2      245          783       10
           246          556       10
           247          547        9
           248          252        9
           249          249        6

[500 rows x 2 columns]

In [79]:
week1_2.loc['any string']

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [80]:
week1_2.loc[('any string',)]

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [81]:
week1_2.loc[('any string', 155)]

Customer ID    114
Food ID          5
Name: (any string, 155), dtype: int64

In [82]:
# (key, index_position)
week1_2.loc[('any string', 4)]

Customer ID    155
Food ID          9
Name: (any string, 4), dtype: int64

In [83]:
week1_2.loc[('any string', 4), 'Customer ID']

155

In [84]:
week1_2.loc[('any string', 4), ['Customer ID', 'Food ID']]

Customer ID    155
Food ID          9
Name: (any string, 4), dtype: int64

In [85]:
week1_2.loc[('any string', 4), ['Food ID']]

Food ID    9
Name: (any string, 4), dtype: int64

### Join

In [93]:
week1.merge(week2, how='inner')

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [96]:
week1.merge(week2, how='inner', on=['Customer ID', 'Food ID'])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [106]:
week1_2_merge = week1.merge(week2, how='inner', on='Customer ID')

#### ^ When pandas merges week1 and week2, it doesn't know whether to merge week1 to week2 or week2 to week1 because they both share the same customer id, so, it duplicates the process.
#### So when we inner join, it doesn't remove the duplicates

In [122]:
week1_2_merge

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           155          1          3
3           503          5          8
4           503          5          9
..          ...        ...        ...
57          945          5          4
58          343          3          5
59          343          3          2
60          343          3          7
61          621          9          6

[62 rows x 3 columns]

#### We can see that the above result has _x and _y suffixes and we can change it using an attribute called suffixes

In [127]:
week1_2_merge = week1.merge(week2, how='inner', on='Customer ID', suffixes=[' - week 1', ' - week 2'])

In [128]:
week1_2_merge

    Customer ID  Food ID - week 1  Food ID - week 2
0           537                 9                 5
1           155                 9                 3
2           155                 1                 3
3           503                 5                 8
4           503                 5                 9
..          ...               ...               ...
57          945                 5                 4
58          343                 3                 5
59          343                 3                 2
60          343                 3                 7
61          621                 9                 6

[62 rows x 3 columns]

In [123]:
week1[week1['Customer ID'] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [124]:
week2[week2['Customer ID'] == 155]

     Customer ID  Food ID
208          155        3

#### inner Join

In [129]:
week1_2_merge = week1.merge(week2, how='inner', on=['Customer ID','Food ID'])

In [130]:
week1_2_merge

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [131]:
week1[week1['Customer ID'] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [132]:
week2[week2['Customer ID'] == 21]

    Customer ID  Food ID
30           21        4

In [ ]:
week1[week1['Customer ID'] == 21]

### Outer Join

In [137]:
week1_2_outer = week1.merge(week2, how='outer', on='Customer ID', suffixes=[' - week 1', ' - week 2'])

In [138]:
week1_2_outer

     Customer ID  Food ID - week 1  Food ID - week 2
0            537               9.0               5.0
1             97               4.0               NaN
2            658               1.0               NaN
3            202               2.0               NaN
4            155               9.0               3.0
..           ...               ...               ...
449          855               NaN               4.0
450          559               NaN              10.0
451          276               NaN               4.0
452          556               NaN              10.0
453          252               NaN               9.0

[454 rows x 3 columns]

In [140]:
week1[week1['Customer ID'] == 622]

Empty DataFrame
Columns: [Customer ID, Food ID]
Index: []

In [141]:
week2[week2['Customer ID'] == 622]

     Customer ID  Food ID
204          622        9

### we get the value as   622 NaN 9.0
#### 622 -> customer id, NaN -> week 1 food id and 9.0  -> week 2 food id

### Indicator attribute
### is used to tell us where it was found, in left, right or both table

In [142]:
week1_2_outer = week1.merge(week2, how='outer', on='Customer ID', suffixes=[' - week 1', ' - week 2'], indicator=True)

In [143]:
week1_2_outer

     Customer ID  Food ID - week 1  Food ID - week 2      _merge
0            537               9.0               5.0        both
1             97               4.0               NaN   left_only
2            658               1.0               NaN   left_only
3            202               2.0               NaN   left_only
4            155               9.0               3.0        both
..           ...               ...               ...         ...
449          855               NaN               4.0  right_only
450          559               NaN              10.0  right_only
451          276               NaN               4.0  right_only
452          556               NaN              10.0  right_only
453          252               NaN               9.0  right_only

[454 rows x 4 columns]

In [147]:
week1_2_outer['_merge'].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [148]:
week1_2_outer['_merge'].isin(['left_only', 'right_only'])

0      False
1       True
2       True
3       True
4      False
       ...
449     True
450     True
451     True
452     True
453     True
Name: _merge, Length: 454, dtype: bool

### Left join

In [149]:
week1_2_left = week1.merge(week2, how='left', on='Customer ID', indicator=True)

In [150]:
week1_2_left

     Customer ID  Food ID_x  Food ID_y     _merge
0            537          9        5.0       both
1             97          4        NaN  left_only
2            658          1        NaN  left_only
3            202          2        NaN  left_only
4            155          9        3.0       both
..           ...        ...        ...        ...
252          413          9        NaN  left_only
253          926          6        NaN  left_only
254          134          3        NaN  left_only
255          396          6        NaN  left_only
256          535         10        NaN  left_only

[257 rows x 4 columns]

In [152]:
week1_2_left['_merge'].isin(['right_only'])

0      False
1      False
2      False
3      False
4      False
       ...
252    False
253    False
254    False
255    False
256    False
Name: _merge, Length: 257, dtype: bool

In [154]:
week1_2_left = week1.merge(week2, how='left', on='Food ID', indicator=True)

In [155]:
week1_2_left

      Customer ID_x  Food ID  Customer ID_y _merge
0               537        9            729   both
1               537        9            732   both
2               537        9            381   both
3               537        9            379   both
4               537        9            574   both
...             ...      ...            ...    ...
6218            535       10            463   both
6219            535       10            734   both
6220            535       10            559   both
6221            535       10            783   both
6222            535       10            556   both

[6223 rows x 4 columns]

In [158]:
week1_2_left[week1_2_left['_merge'].isin(['left_only'])]

Empty DataFrame
Columns: [Customer ID_x, Food ID, Customer ID_y, _merge]
Index: []

In [159]:
week1_2_left[week1_2_left['_merge'].isin(['right_only'])]

Empty DataFrame
Columns: [Customer ID_x, Food ID, Customer ID_y, _merge]
Index: []